app/views/teams/show.html.erb

SELECT "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1  [["team_id", 1]]
---
<ul>
<% @team.players.each do |player| %>