app/views/teams/simulation.html.erb

      <th>Point Guards</th>
      <td><%= @user_team.players.find_by(position: 'Point Guard').name %></td>
      <td><%= @cpu_team.players.find_by(position: 'Point Guard').name %></td>
---
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 2], ["position", "Point Guard"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 2], ["position", "Shooting Guard"], ["LIMIT", 1]]

      <th>Shooting Guards</th>
      <td><%= @user_team.players.find_by(position: 'Shooting Guard').name %></td>
      <td><%= @cpu_team.players.find_by(position: 'Shooting Guard').name %></td>
---
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 2], ["position", "Small Forward"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 1], ["position", "Small Forward"], ["LIMIT", 1]]

      <th>Small Forwards</th>
      <td><%= @user_team.players.find_by(position: 'Small Forward').name %></td>
      <td><%= @cpu_team.players.find_by(position: 'Small Forward').name %></td>
---
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 1], ["position", "Power Forward"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 1], ["position", "Small Forward"], ["LIMIT", 1]]

      <th>Power Forwards</th>
      <td><%= @user_team.players.find_by(position: 'Power Forward').name %></td>
      <td><%= @cpu_team.players.find_by(position: 'Power Forward').name %></td>
---
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 2], ["position", "Power Forward"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 1], ["position", "Power Forward"], ["LIMIT", 1]]

      <th>Centers</th>
      <td><%= @user_team.players.find_by(position: 'Center').name %></td>
      <td><%= @cpu_team.players.find_by(position: 'Center').name %></td>
---
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 2], ["position", "Center"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1 AND "players"."position" = $2 LIMIT $3  [["team_id", 1], ["position", "Center"], ["LIMIT", 1]]