app/views/users/show.html.erb

<ul>
  <% @user.teams.each do |team| %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = $1  [["user_id", 2]]