app/controllers/drafts_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."position" = $1 LIMIT $2  [["position", "Point Guard"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."position" = $1 LIMIT $2  [["position", "Shooting Guard"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."position" = $1 LIMIT $2  [["position", "Small Forward"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."position" = $1 LIMIT $2  [["position", "Power Forward"], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."position" = $1 LIMIT $2  [["position", "Center"], ["LIMIT", 1]]
---
  def new
    @team = Team.find(params[:id])
    @point_guards = Player.where(position: 'Point Guard')
    @shooting_guards = Player.where(position: 'Shooting Guard')
    @small_forwards = Player.where(position: 'Small Forward')
    @power_forwards = Player.where(position: 'Power Forward')
    @centers = Player.where(position: 'Center')

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 15], ["team_id", 1], ["created_at", "2019-01-23 18:49:55.751504"], ["updated_at", "2019-01-23 18:49:55.751504"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 14], ["team_id", 1], ["created_at", "2019-01-23 18:49:55.755958"], ["updated_at", "2019-01-23 18:49:55.755958"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 10], ["team_id", 1], ["created_at", "2019-01-23 18:49:55.761644"], ["updated_at", "2019-01-23 18:49:55.761644"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 5], ["team_id", 1], ["created_at", "2019-01-23 18:49:55.764358"], ["updated_at", "2019-01-23 18:49:55.764358"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 7], ["team_id", 1], ["created_at", "2019-01-23 18:49:55.766892"], ["updated_at", "2019-01-23 18:49:55.766892"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def create
    @team = Team.find(draft_params('team_id')['team_id'])
    pg_id = draft_params(point_guard: :player_id)[:point_guard][:player_id]
    sg_id = draft_params(shooting_guard: :player_id)[:shooting_guard][:player_id]
    sf_id = draft_params(small_forward: :player_id)[:small_forward][:player_id]
    pf_id = draft_params(power_forward: :player_id)[:power_forward][:player_id]
    c_id = draft_params(center: :player_id)[:center][:player_id]
    @team.players << Player.find(pg_id)
    @team.players << Player.find(sg_id)
    @team.players << Player.find(sf_id)
    @team.players << Player.find(pf_id)
    @team.players << Player.find(c_id)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."position" = $1  [["position", "Point Guard"]]
SELECT "players".* FROM "players" INNER JOIN "drafts" ON "players"."id" = "drafts"."player_id" WHERE "drafts"."team_id" = $1  [["team_id", 2]]
---
  def edit
    @team = Team.find(params[:id])
    @point_guards = Player.where(position: 'Point Guard')
    @selected_pg = @team.players.find { |player| player.position == 'Point Guard' }

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "drafts" WHERE "drafts"."id" = $1  [["id", 11]]
SELECT "drafts".* FROM "drafts" WHERE "drafts"."team_id" = $1  [["team_id", 2]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 20], ["team_id", 2], ["created_at", "2019-01-24 15:38:20.110805"], ["updated_at", "2019-01-24 15:38:20.110805"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 30], ["team_id", 2], ["created_at", "2019-01-24 15:38:20.114087"], ["updated_at", "2019-01-24 15:38:20.114087"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 19], ["team_id", 2], ["created_at", "2019-01-24 15:38:20.116495"], ["updated_at", "2019-01-24 15:38:20.116495"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 32], ["team_id", 2], ["created_at", "2019-01-24 15:38:20.119702"], ["updated_at", "2019-01-24 15:38:20.119702"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 24], ["team_id", 2], ["created_at", "2019-01-24 15:38:20.122178"], ["updated_at", "2019-01-24 15:38:20.122178"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def update
    @team = Team.find(draft_params('team_id')['team_id'])
    pg_id = draft_params(point_guard: :player_id)[:point_guard][:player_id]
    sg_id = draft_params(shooting_guard: :player_id)[:shooting_guard][:player_id]
    sf_id = draft_params(small_forward: :player_id)[:small_forward][:player_id]
    pf_id = draft_params(power_forward: :player_id)[:power_forward][:player_id]
    c_id = draft_params(center: :player_id)[:center][:player_id]
    Draft.where(team_id: @team.id).destroy_all
    @team.players << Player.find(pg_id)
    @team.players << Player.find(sg_id)
    @team.players << Player.find(sf_id)
    @team.players << Player.find(pf_id)
    @team.players << Player.find(c_id)