app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "hometown", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "\"Cheeses\""], ["hometown", "Dumbo"], ["user_id", 4], ["created_at", "2019-01-24 22:24:11.533732"], ["updated_at", "2019-01-24 22:24:11.533732"]]
---
  def create
    current_user
    @team = Team.create(team_params)

UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "Killerzzz"], ["updated_at", "2019-01-28 01:06:46.325543"], ["id", 17]]
---
  def update
    find_team
    @team.update(team_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def simulator
    @user_team = Team.find(params[:id])
    @result = simulate(@user_team)
    @cpu_team = Team.find_by(user_id: 1)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_team
    @team = Team.find(params[:id])