app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "mipucarelli"], ["password_digest", "$2a$10$EstpKq0ReBI41TMO71cSeuhtkDSIGmK5uF3X62FhM/qbb5m9BvAh6"], ["updated_at", "2019-01-23 23:23:58.786046"], ["id", 1]]
---
  def update
    find_user
    @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    @user = User.find(params[:id])