app/models/simulation.rb

  def simulate(user_team)
    cpu_team = Team.find_by(user_id: 1)
    Draft.where(team_id: cpu_team.id).destroy_all
    cpu_team.players << Player.where(position: 'Point Guard').sample
    cpu_team.players << Player.where(position: 'Shooting Guard').sample
    cpu_team.players << Player.where(position: 'Small Forward').sample
    cpu_team.players << Player.where(position: 'Power Forward').sample
    cpu_team.players << Player.where(position: 'Center').sample
---
SELECT  "teams".* FROM "teams" WHERE "teams"."user_id" = $1 LIMIT $2  [["user_id", 0], ["LIMIT", 1]]
DELETE FROM "drafts" WHERE "drafts"."id" = $1  [["id", 6]]
SELECT "drafts".* FROM "drafts" WHERE "drafts"."team_id" = $1  [["team_id", 1]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 4], ["team_id", 1], ["created_at", "2019-01-24 22:43:03.145607"], ["updated_at", "2019-01-24 22:43:03.145607"]]
SELECT "players".* FROM "players" WHERE "players"."position" = $1  [["position", "Point Guard"]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 14], ["team_id", 1], ["created_at", "2019-01-24 22:43:03.188304"], ["updated_at", "2019-01-24 22:43:03.188304"]]
SELECT "players".* FROM "players" WHERE "players"."position" = $1  [["position", "Shooting Guard"]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 15], ["team_id", 1], ["created_at", "2019-01-24 22:43:03.191482"], ["updated_at", "2019-01-24 22:43:03.191482"]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 15], ["team_id", 1], ["created_at", "2019-01-24 22:43:03.194005"], ["updated_at", "2019-01-24 22:43:03.194005"]]
INSERT INTO "drafts" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", 13], ["team_id", 1], ["created_at", "2019-01-24 22:43:03.196622"], ["updated_at", "2019-01-24 22:43:03.196622"]]